
# [Tables](https://www.inferentialthinking.com/chapters/06/Tables) (Inferential Thinking - 6)

A Table is a fundamental object type that represents data set. You can view a Table as either one of these:
* A sequence of labeled columns
* A sequence of rows in which each contain all information about a single entry
    * Labels are strings
    * Columns are arrays, all with the same length

<img src = "table_example.jpg" width = 600 />

We need to import **datascience** library to be able to use Table.

In [1]:
from datascience import *

Use **Table()** to create an empty Table. You can extend an empty Table to contain new rows and columns.

In [2]:
Table()

**with_columns** (or **with_column**) method constructs a Table with labeled columns. Each column contains an array.
To add a new column to a table, call **with_columns** with a label and an array.

In [3]:
Table().with_columns('Number of petals', make_array(8, 34, 5))

Number of petals
8
34
5

We can create a Table with multiple columns. Note that each column has to be the same length or else an error will occur!

In [4]:
Table().with_columns(
    'Number of petals', make_array(8, 34, 5),
    'Name', make_array('lotus', 'sunflower', 'rose')
)

Number of petals | Name
8                | lotus
34               | sunflower
5                | rose

If we just create Tables without doing anything further, the Tables we've created so far will be created and thrown away. If you want to use the Table again, you need to assign the Table to a name.

In [5]:
flowers = Table().with_columns(
    'Number of petals', make_array(8, 34, 5),
    'Name', make_array('lotus', 'sunflower', 'rose')
)
flowers

Number of petals | Name
8                | lotus
34               | sunflower
5                | rose

The **with_columns** method adds a column to a table. HOWEVER, beware that the table itself is unchanged! You have to save it to a name or else the table along with the added column will be lost!

In [6]:
flowers.with_columns(
    'Color', make_array('pink', 'yellow', 'red')
)

Number of petals | Name      | Color
8                | lotus     | pink
34               | sunflower | yellow
5                | rose      | red

In [7]:
flowers

Number of petals | Name
8                | lotus
34               | sunflower
5                | rose

In [8]:
#Save the changes!
flowers = flowers.with_columns(
    'Color', make_array('pink', 'yellow', 'red')
)
flowers

Number of petals | Name      | Color
8                | lotus     | pink
34               | sunflower | yellow
5                | rose      | red


## Minard's Map

### Charles Joseph Minard, 1781 - 1870
* French civil engineer who created one of the greatest graph of all times
* Visualized Napoleon's invasion to Russia in 1812
    * Number of soldiers
    * Direction of the invasion
    * Latitude and longitude of each city
    * Temperature on the return journey
    * Dates in November and December
<img src = "minard_map.png"/>

Here we use the method **read_table** to read a CSV (comma-separated values) that contains some of the data used by Minard in his map. (Make sure the file **minard.csv** is in the same directory as this Jupyter Notebook).

In [9]:
minard = Table.read_table('minard.csv')
minard

Longitude | Latitude | City        | Direction | Survivors
32        | 54.8     | Smolensk    | Advance   | 145000
33.2      | 54.9     | Dorogobouge | Advance   | 140000
34.4      | 55.5     | Chjat       | Advance   | 127100
37.6      | 55.8     | Moscou      | Advance   | 100000
34.3      | 55.2     | Wixma       | Retreat   | 55000
32        | 54.6     | Smolensk    | Retreat   | 24000
30.4      | 54.4     | Orscha      | Retreat   | 20000
26.8      | 54.3     | Moiodexno   | Retreat   | 12000

<img src = "different_types.jpg"/>

Below we look up the number of columns, rows and the labels of **minard** table, consecutively.

In [10]:
minard.num_columns

5

In [11]:
minard.num_rows

8

In [13]:
minard.labels

('Longitude', 'Latitude', 'City', 'Direction', 'Survivors')

We can change column labels using **relabeled**. This creates a new table and leaves minard unchanged (if we don't save it to a name, the change will be lost!). Below we change the **City** label with **City Name**.

In [14]:
minard.relabeled('City', 'City Name')

Longitude | Latitude | City Name   | Direction | Survivors
32        | 54.8     | Smolensk    | Advance   | 145000
33.2      | 54.9     | Dorogobouge | Advance   | 140000
34.4      | 55.5     | Chjat       | Advance   | 127100
37.6      | 55.8     | Moscou      | Advance   | 100000
34.3      | 55.2     | Wixma       | Retreat   | 55000
32        | 54.6     | Smolensk    | Retreat   | 24000
30.4      | 54.4     | Orscha      | Retreat   | 20000
26.8      | 54.3     | Moiodexno   | Retreat   | 12000

We can access a column's array of data using either the column's label or the column index.

In [15]:
minard.column('Survivors')

array([145000, 140000, 127100, 100000,  55000,  24000,  20000,  12000])

In [16]:
minard.column(4)

array([145000, 140000, 127100, 100000,  55000,  24000,  20000,  12000])

We can also further access an element of the array using **item(array index)**.

In [17]:
minard.column(4).item(0)

145000

In [18]:
minard.column(4).item(5)

24000

### Working with Data in Columns
Columns are arrays, and thus we can do array operations on them to discover new information. In the example below, we calculated the percentage of survivors after the Smolensk city.

In [19]:
initial = minard.column('Survivors').item(0)
minard = minard.with_columns(
    'Percent Surviving', minard.column('Survivors')/initial
)
minard

Longitude | Latitude | City        | Direction | Survivors | Percent Surviving
32        | 54.8     | Smolensk    | Advance   | 145000    | 1
33.2      | 54.9     | Dorogobouge | Advance   | 140000    | 0.965517
34.4      | 55.5     | Chjat       | Advance   | 127100    | 0.876552
37.6      | 55.8     | Moscou      | Advance   | 100000    | 0.689655
34.3      | 55.2     | Wixma       | Retreat   | 55000     | 0.37931
32        | 54.6     | Smolensk    | Retreat   | 24000     | 0.165517
30.4      | 54.4     | Orscha      | Retreat   | 20000     | 0.137931
26.8      | 54.3     | Moiodexno   | Retreat   | 12000     | 0.0827586

The 'Percent Surviving' data don't look like percentage, so they might look ugly to you! Fortunately, we can change the format of the data using **set_format**.

In [20]:
minard.set_format('Percent Surviving', PercentFormatter)

Longitude | Latitude | City        | Direction | Survivors | Percent Surviving
32        | 54.8     | Smolensk    | Advance   | 145000    | 100.00%
33.2      | 54.9     | Dorogobouge | Advance   | 140000    | 96.55%
34.4      | 55.5     | Chjat       | Advance   | 127100    | 87.66%
37.6      | 55.8     | Moscou      | Advance   | 100000    | 68.97%
34.3      | 55.2     | Wixma       | Retreat   | 55000     | 37.93%
32        | 54.6     | Smolensk    | Retreat   | 24000     | 16.55%
30.4      | 54.4     | Orscha      | Retreat   | 20000     | 13.79%
26.8      | 54.3     | Moiodexno   | Retreat   | 12000     | 8.28%

### Choosing Sets of Columns
Columns are arrays, and thus we can do array operations on them to discover new information. In the example below, we calculated the percentage of survivors after the Smolensk city.

We can select specific columns from a Table using **select**.

In [21]:
minard.select('Longitude', 'Latitude')

Longitude | Latitude
32        | 54.8
33.2      | 54.9
34.4      | 55.5
37.6      | 55.8
34.3      | 55.2
32        | 54.6
30.4      | 54.4
26.8      | 54.3

We can do the same thing using indeces instead of labels.

In [22]:
minard.select(0, 1)

Longitude | Latitude
32        | 54.8
33.2      | 54.9
34.4      | 55.5
37.6      | 55.8
34.3      | 55.2
32        | 54.6
30.4      | 54.4
26.8      | 54.3

Note that **.column** returns an array, while **.select** returns a table.

In [24]:
minard.column('Survivors') + 1

array([145001, 140001, 127101, 100001,  55001,  24001,  20001,  12001])

In [25]:
minard.select('Survivors') + 1

TypeError: unsupported operand type(s) for +: 'Table' and 'int'


# The Growth Mindset
* Fixed Mindset: Belief that intelligence is static/fixed
    * Difficulty implies you'll never succeed
    * Little reason to try because intelligence is fixed
    * Criticismn means you aren't good enough
* Growth Mindset: Belief that intelligence can be developed
    * Difficulty implies you should put in more effort
    * Use criticism to improve and learn